; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_4 ?v2 - type_1 ?v5 - type_3)
 	      (pred_2 ?v6 - object ?v5 - type_3)
	      (pred_1 ?v2 - type_1 ?v8 - type_2)
	      (pred_3 ?v2 - type_1 ?v6 - object ?v8 - type_2))

   (:action op_2
       :parameters  (?v2 - type_1 ?v1 ?v7 - type_3)
       :precondition (and  (pred_4 ?v2 ?v1))
       :effect (and  (pred_4 ?v2 ?v7)
		     (not (pred_4 ?v2 ?v1))))

   (:action op_1
       :parameters (?v2 - type_1 ?v3 - object ?v4 - type_3 ?v8 - type_2)
       :precondition  (and  (pred_2 ?v3 ?v4) (pred_4 ?v2 ?v4) (pred_1 ?v2 ?v8))
       :effect (and (pred_3 ?v2 ?v3 ?v8)
		    (not (pred_2 ?v3 ?v4)) 
		    (not (pred_1 ?v2 ?v8))))

   (:action op_3
       :parameters (?v2 - type_1 ?v3 - object ?v4 - type_3 ?v8 - type_2)
       :precondition  (and  (pred_3 ?v2 ?v3 ?v8) (pred_4 ?v2 ?v4))
       :effect (and (pred_2 ?v3 ?v4)
		    (pred_1 ?v2 ?v8)
		    (not (pred_3 ?v2 ?v3 ?v8)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_02 obj_12 - type_1
obj_08 obj_04 obj_13 obj_05 - type_2
obj_11 obj_03 obj_07 obj_09 - type_3
obj_01 obj_10 obj_06 - object)
(:init
(pred_4 obj_02 obj_07)
(pred_1 obj_02 obj_08)
(pred_1 obj_02 obj_04)
(pred_4 obj_12 obj_09)
(pred_1 obj_12 obj_13)
(pred_1 obj_12 obj_05)
(pred_2 obj_01 obj_03)
(pred_2 obj_10 obj_11)
(pred_2 obj_06 obj_11)
)
(:goal
(and
(pred_2 obj_01 obj_07)
(pred_2 obj_10 obj_07)
(pred_2 obj_06 obj_09)
)
)

(:constraints
  (and
    (always (not (and (pred_4 obj_02 obj_07) (pred_4 obj_12 obj_07))))
    (always (not (and (pred_4 obj_02 obj_09) (pred_4 obj_12 obj_09))))
  )
)
)

; plan
1. (op_2 obj_02 obj_07 obj_03)
   deleted: (pred_4 obj_02 obj_07)
   added: (pred_4 obj_02 obj_03)
   goals met: 0 of 3
2. (op_2 obj_12 obj_09 obj_11)
   deleted: (pred_4 obj_12 obj_09)
   added: (pred_4 obj_12 obj_11)
   goals met: 0 of 3
3. (op_1 obj_02 obj_01 obj_03 obj_04)
   deleted: (pred_2 obj_01 obj_03) (pred_1 obj_02 obj_04)
   added: (pred_3 obj_02 obj_01 obj_04)
   goals met: 0 of 3
4. (op_1 obj_12 obj_06 obj_11 obj_05)
   deleted: (pred_2 obj_06 obj_11) (pred_1 obj_12 obj_05)
   added: (pred_3 obj_12 obj_06 obj_05)
   goals met: 0 of 3
5. (op_1 obj_12 obj_10 obj_11 obj_13)
   deleted: (pred_2 obj_10 obj_11) (pred_1 obj_12 obj_13)
   added: (pred_3 obj_12 obj_10 obj_13)
   goals met: 0 of 3
6. (op_2 obj_02 obj_03 obj_07)
   deleted: (pred_4 obj_02 obj_03)
   added: (pred_4 obj_02 obj_07)
   goals met: 0 of 3
7. (op_2 obj_12 obj_11 obj_09)
   deleted: (pred_4 obj_12 obj_11)
   added: (pred_4 obj_12 obj_09)
   goals met: 0 of 3
8. (op_3 obj_02 obj_01 obj_07 obj_04)
   deleted: (pred_3 obj_02 obj_01 obj_04)
   added: (pred_2 obj_01 obj_07) (pred_1 obj_02 obj_04)
   goals met: 1 of 3
9. (op_3 obj_12 obj_06 obj_09 obj_05)
   deleted: (pred_3 obj_12 obj_06 obj_05)
   added: (pred_2 obj_06 obj_09) (pred_1 obj_12 obj_05)
   goals met: 2 of 3
10. (op_2 obj_02 obj_07 obj_11)
   deleted: (pred_4 obj_02 obj_07)
   added: (pred_4 obj_02 obj_11)
   goals met: 2 of 3
11. (op_2 obj_12 obj_09 obj_07)
   deleted: (pred_4 obj_12 obj_09)
   added: (pred_4 obj_12 obj_07)
   goals met: 2 of 3
12. (op_3 obj_12 obj_10 obj_07 obj_13)
   deleted: (pred_3 obj_12 obj_10 obj_13)
   added: (pred_2 obj_10 obj_07) (pred_1 obj_12 obj_13)
   goals met: 3 of 3
